In [1]:
import pandas as pd

In [6]:
pd.read_csv('alumnos.csv')

     nombre  altura  peso  edad sexo
0      Luis    1.70    70    30    m
1    Andrea    1.50    50    25    f
2     Tainy    1.45    40    30    f
3  Catalina    1.50    60    40    f
4    Andres    1.73    73    29    m
5     Puchi    1.20    20     2    m

In [7]:
df = pd.read_csv('alumnos.csv')

In [8]:
df.head()

     nombre  altura  peso  edad sexo
0      Luis    1.70    70    30    m
1    Andrea    1.50    50    25    f
2     Tainy    1.45    40    30    f
3  Catalina    1.50    60    40    f
4    Andres    1.73    73    29    m

In [9]:
df.head(1)

  nombre  altura  peso  edad sexo
0   Luis     1.7    70    30    m

In [10]:
df.columns

Index(['nombre', 'altura', 'peso', 'edad', 'sexo'], dtype='object')

In [11]:
df['altura']

0    1.70
1    1.50
2    1.45
3    1.50
4    1.73
5    1.20
Name: altura, dtype: float64

In [12]:
type(df['altura'])

pandas.core.series.Series

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.iloc[1,:]

nombre    Andrea
altura       1.5
peso          50
edad          25
sexo           f
Name: 1, dtype: object

In [15]:
df.loc[1,:]

nombre    Andrea
altura       1.5
peso          50
edad          25
sexo           f
Name: 1, dtype: object

In [16]:
type(df.loc[1,:])

pandas.core.series.Series

In [17]:
df['sexo'].index

RangeIndex(start=0, stop=6, step=1)

In [18]:
df['sexo'].values

array(['m', 'f', 'f', 'f', 'm', 'm'], dtype=object)